from django import forms  # Δημιουργία φορμών
from .models import Device,Signal  # Εισαγωγή μοντέλων Device και Signal από το τοπικό αρχείο models.py

# Δημιουργία κλάσης που η φόρμα βασίζεται στο μοντέλο Device και θα δημιουργήσει αυτόματα πεδία
class DeviceForm(forms.ModelForm):
    class Meta:  # Δημιουργία κλάσης που χρησιμοποιείται για να καθορίσει μετα-δεδομένα που βοηθούν στην συμπεριφορά της φόρμας
        model = Device  # Ορίζει ότι η φόρμα θα βασίζεται στο μοντέλο Device
        fields = ['name', 'description']  # Ορίζει ποια πεδία από το μοντέλο Device θα συμπεριληφθούν στη φόρμα

# Δημιουργία κλάσης που η φόρμα βασίζεται στο μοντέλο Signal και θα δημιουργήσει αυτόματα πεδία
class SignalForm(forms.ModelForm):
    class Meta:  # Δημιουργία κλάσης που χρησιμοποιείται για να καθορίσει μετα-δεδομένα που βοηθούν στην συμπεριφορά της φόρμας
        model = Signal  # Ορίζει ότι η φόρμα θα βασίζεται στο μοντέλο Signal
        fields = ['device','timestamp', 'value','signal_type']  # Ορίζει ποια πεδία από το μοντέλο Signal θα συμπεριληφθούν στη φόρμα